[{
"id": 1,
"name": "To Kill a Mockingbird",
"author": "Harper Lee",
"image": "/public/books/To_Kill_a_Mockingbird_(first_edition_cover).jpg",
"review": "To Kill a Mockingbird by Harper Lee is a timeless classic that delves deep into the heart of human nature and society's struggles. Through the eyes of Scout Finch, we witness the injustices of racial discrimination and the journey towards moral enlightenment in the backdrop of 1930s Alabama. Lee's narrative is both poignant and powerful, shedding light on themes of empathy, compassion, and the quest for truth. With its masterful storytelling and unforgettable characters like Atticus Finch, this novel continues to resonate with readers of all ages, urging us to confront the complexities of prejudice and uphold the principles of justice.",
"totalPages": 281,
"rating": 4.5,
"category": "Fiction",
"tags": ["Classics", "Social"],
"publisher": "J. B. Lippincott & Co.",
"yearOfPublishing": 1960
},
{
"id": 2,
"name": "1984",
"author": "George Orwell",
"image": "/books/1984_first_edition_cover.jpg",
"review": "George Orwell's 1984 stands as a haunting portrayal of a dystopian future where totalitarianism reigns supreme. Set in a world of perpetual war and government surveillance, the novel follows the life of Winston Smith as he rebels against the oppressive regime of Big Brother. Orwell's bleak vision serves as a chilling warning about the dangers of authoritarianism and the erosion of individual freedom. Through vivid imagery and thought-provoking themes, 1984 remains eerily relevant in today's society, prompting readers to question the nature of power, truth, and the human spirit.",
"totalPages": 328,
"rating": 4.7,
"category": "Science Fiction",
"tags": ["Dystopian", "Political"],
"publisher": "Secker & Warburg",
"yearOfPublishing": 1949
},
{
"id": 3,
"name": "The Great Gatsby",
"author": "F. Scott Fitzgerald",
"image": "/books/The_Great_Gatsby_Cover_1925_Retouched.jpg",
"review": "F. Scott Fitzgerald's The Great Gatsby is a timeless masterpiece that captures the essence of the Jazz Age and the elusive pursuit of the American Dream. Set amidst the opulent world of Long Island's elite, the novel follows the enigmatic Jay Gatsby and his relentless quest to win back the love of his life, Daisy Buchanan. Through Fitzgerald's lyrical prose and vivid characterizations, we are drawn into a world of love, wealth, and disillusionment. The Great Gatsby remains a poignant commentary on the emptiness of materialism and the fleeting nature of happiness.",
"totalPages": 180,
"rating": 4.3,
"category": "Fiction",
"tags": ["Romance", "Jazz"],
"publisher": "Charles Scribner's Sons",
"yearOfPublishing": 1925
},
{
"id": 4,
"name": "Pride and Prejudice",
"author": "Jane Austen",
"image": "/books/PrideAndPrejudiceTitlePage.jpg",
"review": "Jane Austen's Pride and Prejudice is a timeless tale of love, wit, and social commentary that continues to enchant readers worldwide. Set in the genteel society of early 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the complexities of love and marriage. Through Austen's sharp wit and keen observations, we are treated to a delightful comedy of manners that explores themes of class, prejudice, and the pursuit of happiness. With its memorable characters and sparkling dialogue, Pride and Prejudice remains a beloved classic for generations to come.",
"totalPages": 279,
"rating": 4.6,
"category": "Fiction",
"tags": ["Romance", "Classic"],
"publisher": "T. Egerton, Whitehall",
"yearOfPublishing": 1813
},
{
"id": 5,
"name": "Harry Potter and the Sorcerer's Stone",
"author": "J.K. Rowling",
"image": "/books/Harry_Potter_and_the_Philosopher's_Stone_Book_Cover.jpg",
"review": "J.K. Rowling's Harry Potter and the Sorcerer's Stone is a spellbinding introduction to the magical world of Hogwarts School of Witchcraft and Wizardry. Through the eyes of the young wizard Harry Potter, readers embark on an enchanting journey filled with friendship, courage, and the battle against darkness. Rowling's imaginative storytelling and richly detailed universe have captivated millions of readers worldwide, making this book a beloved classic of children's literature. With its themes of bravery, loyalty, and the power of love, Harry Potter and the Sorcerer's Stone continues to inspire readers of all ages.",
"totalPages": 309,
"rating": 4.8,
"category": "Fantasy",
"tags": ["Magic", "Adventure"],
"publisher": "Bloomsbury",
"yearOfPublishing": 1997
},
{
"id": 6,
"name": "The Catcher in the Rye",
"author": "J.D. Salinger",
"image": "/books/The_Catcher_in_the_Rye_(1951,_first_edition_cover).jpg",
"review": "J.D. Salinger's The Catcher in the Rye is a timeless exploration of adolescent angst and the search for identity in a world filled with phoniness and hypocrisy. Through the eyes of the rebellious teenager Holden Caulfield, readers are taken on a journey of self-discovery and disillusionment as he grapples with the complexities of growing up. Salinger's candid portrayal of teenage rebellion and alienation continues to resonate with readers of all generations, making The Catcher in the Rye an enduring classic of American literature.",
"totalPages": 224,
"rating": 4.4,
"category": "Fiction",
"tags": ["Coming", "American"],
"publisher": "Little, Brown and Company",
"yearOfPublishing": 1951
},
{
  "id": 7,
  "name": "The Hobbit",
  "author": "J.R.R. Tolkien",
  "image": "/books/TheHobbit_FirstEdition.jpg",
  "review": "J.R.R. Tolkien's The Hobbit is a timeless adventure that transports readers to the enchanting world of Middle-earth. Follow Bilbo Baggins, a hobbit of the Shire, as he embarks on an epic quest to reclaim the treasure guarded by the fearsome dragon Smaug. Along the way, Bilbo encounters trolls, elves, and goblins, forming unexpected friendships and facing incredible dangers. Tolkien's richly imagined universe comes to life with vivid descriptions and captivating storytelling, making The Hobbit an enduring classic of fantasy literature that appeals to readers of all ages.",
  "totalPages": 310,
  "rating": 4.7,
  "category": "Fantasy",
  "tags": ["Adventure", "High"],
  "publisher": "Allen & Unwin",
  "yearOfPublishing": 1937
},
{
  "id": 8,
  "name": "The Da Vinci Code",
  "author": "Dan Brown",
  "image": "/books/DaVinciCode.jpg",
  "review": "Dan Brown's The Da Vinci Code is an electrifying thriller that seamlessly blends art, history, and conspiracy theories into a pulse-pounding narrative. When renowned symbologist Robert Langdon is summoned to investigate a murder at the Louvre, he uncovers a trail of clues that lead to a shocking secret hidden for centuries. As Langdon races against time to unravel the mystery, he finds himself caught in a web of deceit and danger, pursued by shadowy forces determined to protect the truth at any cost. With its relentless pace and intricate plot twists, The Da Vinci Code keeps readers on the edge of their seats until the final revelation.",
  "totalPages": 454,
  "rating": 4.2,
  "category": "Thriller",
  "tags": ["Mystery", "Conspiracy"],
  "publisher": "Doubleday",
  "yearOfPublishing": 2003
},
{
  "id": 9,
  "name": "The Lord of the Rings",
  "author": "J.R.R. Tolkien",
  "image": "/books/First_Single_Volume_Edition_of_The_Lord_of_the_Rings.gif",
  "review": "J.R.R. Tolkien's The Lord of the Rings is a sweeping epic that transports readers to the enchanting realm of Middle-earth, where a heroic fellowship embarks on a perilous quest to destroy the One Ring and vanquish the dark lord Sauron. From the idyllic Shire to the fiery depths of Mount Doom, Tolkien's masterful world-building and rich mythology captivate the imagination, weaving a tapestry of adventure, friendship, and sacrifice. As Frodo Baggins and his companions confront evil in its many forms, they discover the true power of courage, loyalty, and hope. With its timeless themes and unforgettable characters, The Lord of the Rings remains a towering achievement in fantasy literature.",
  "totalPages": 870,
  "rating": 4.9,
  "category": "Fantasy",
  "tags": ["Epic", "Adventure"],
  "publisher": "Allen & Unwin",
  "yearOfPublishing": 1954
}
]